SoCXin/HC32M120/src/template/hc32m120j6tb_template/example/EWARM/hc32m120j6tb.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>EFM</name>
            <description>desc EFM</description>
            <baseAddress>0x40000800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x285</size>
            </addressBlock>
            <registers>
                <register>
                    <name>FAPRT</name>
                    <description>desc FAPRT</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FAPRT</name>
                            <description>desc FAPRT</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FSTP</name>
                    <description>desc FSTP</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>FSTP</name>
                            <description>desc FSTP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FRMC</name>
                    <description>desc FRMC</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0x70001</resetMask>
                    <fields>
                        <field>
                            <name>FLWT</name>
                            <description>desc FLWT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CACHE</name>
                            <description>desc CACHE</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PREFETE</name>
                            <description>desc PREFETE</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CRST0</name>
                            <description>desc CRST0</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FWMC</name>
                    <description>desc FWMC</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x171</resetMask>
                    <fields>
                        <field>
                            <name>PEMODE</name>
                            <description>desc PEMODE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PEMOD</name>
                            <description>desc PEMOD</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BUSHLDCTL</name>
                            <description>desc BUSHLDCTL</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FSR</name>
                    <description>desc FSR</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x100</resetValue>
                    <resetMask>0x13B</resetMask>
                    <fields>
                        <field>
                            <name>PEWERR</name>
                            <description>desc PEWERR</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PEPRTERR</name>
                            <description>desc PEPRTERR</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PGMISMTCH</name>
                            <description>desc PGMISMTCH</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OPTEND</name>
                            <description>desc OPTEND</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDCOLERR</name>
                            <description>desc RDCOLERR</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDY</name>
                            <description>desc RDY</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FSCLR</name>
                    <description>desc FSCLR</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3B</resetMask>
                    <fields>
                        <field>
                            <name>PEWERRCLR</name>
                            <description>desc PEWERRCLR</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PEPRTERRCLR</name>
                            <description>desc PEPRTERRCLR</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PGMISMTCHCLR</name>
                            <description>desc PGMISMTCHCLR</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPTENDCLR</name>
                            <description>desc OPTENDCLR</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RDCOLERRCLR</name>
                            <description>desc RDCOLERRCLR</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FITE</name>
                    <description>desc FITE</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>PEERRITE</name>
                            <description>desc PEERRITE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPTENDITE</name>
                            <description>desc OPTENDITE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RDCOLERRITE</name>
                            <description>desc RDCOLERRITE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FPMTSW</name>
                    <description>desc FPMTSW</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7FFF</resetMask>
                    <fields>
                        <field>
                            <name>FPMTSW</name>
                            <description>desc FPMTSW</description>
                            <msb>14</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FPMTEW</name>
                    <description>desc FPMTEW</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7FFF</resetMask>
                    <fields>
                        <field>
                            <name>FPMTEW</name>
                            <description>desc FPMTEW</description>
                            <msb>14</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UQID0</name>
                    <description>desc UQID0</description>
                    <addressOffset>0x50</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>UQID1</name>
                    <description>desc UQID1</description>
                    <addressOffset>0x54</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>UQID2</name>
                    <description>desc UQID2</description>
                    <addressOffset>0x58</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>HRCCFGR</name>
                    <description>desc HRCCFGR</description>
                    <addressOffset>0x282</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>HRCFREQS</name>
                            <description>desc HRCFREQS</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LVDICGCR</name>
                    <description>desc LVDICGCR</description>
                    <addressOffset>0x284</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0</resetMask>
                    <fields>
                        <field>
                            <name>DFS</name>
                            <description>desc DFS</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DFDIS</name>
                            <description>desc DFDIS</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LVDLVL</name>
                            <description>desc LVDLVL</description>
                            <msb>11</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NMIS</name>
                            <description>desc NMIS</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IRS</name>
                            <description>desc IRS</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IRDIS</name>
                            <description>desc IRDIS</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LVDDIS</name>
                            <description>desc LVDDIS</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
